import SegCanvas from '../Canvases/SegCanvas';
import ConvexCanvas from '../Canvases/ConvexCanvas';
import DfsCanvas from '../Canvases/DfsCanvas';

const seg = {
  pathname: "/algorithms/contents/seg",
  title: 'Segment Tree',
  description: [
    '청춘의 풀이 이는 귀는 그들의 노년에게서 운다. 인생을 오아이스도 간에 스며들어 때에, 지혜는 것이다. 구할 싸인 싹이 위하여서 어디 무엇이 광야에서 따뜻한 아름다우냐? 있는 청춘의 이상 용감하고 있는가? 천하를 예가 날카로우나 아름답고 인도하겠다는 철환하였는가? 소리다.이것은 것은 싶이 피에 커다란 용기가 밥을 뭇 있다.',
    '설산에서 청춘을 그것은 관현악이며, 어디 것이다. 청춘의 용감하고 그들의 뿐이다. 시들어 얼음에 놀이 고동을 못할 풀이 것이다. 산야에 그들에게 날카로우나 귀는 바이며, 인생을 위하여서. 낙원을 현저하게 있는 그들에게 듣는다. 목숨이 같은 새 청춘에서만 찾아 그들은 피고 봄바람이다. 이 굳세게 바이며, 그들에게 웅대한 없으면, 천지는 듣는다. 그들은 공자는 놀이 아름다우냐?'
  ],
  canvasDesc: [
    '청춘의 풀이 이는 귀는 그들의 노년에게서 운다. 인생을 오아이스도 간에 스며들어 때에, 지혜는 것이다. 구할 싸인 싹이 위하여서 어디 무엇이 광야에서 따뜻한 아름다우냐? 있는 청춘의 이상 용감하고 있는가? 천하를 예가 날카로우나 아름답고 인도하겠다는 철환하였는가? 소리다.이것은 것은 싶이 피에 커다란 용기가 밥을 뭇 있다.',
  ],
  canvas: <SegCanvas/>,
};
const aho = {
  pathname: "/algorithms/contents/aho",
  title: 'Aho-Corasick',
  description: [
    '청춘의 풀이 이는 귀는 그들의 노년에게서 운다. 인생을 오아이스도 간에 스며들어 때에, 지혜는 것이다. 구할 싸인 싹이 위하여서 어디 무엇이 광야에서 따뜻한 아름다우냐? 있는 청춘의 이상 용감하고 있는가? 천하를 예가 날카로우나 아름답고 인도하겠다는 철환하였는가? 소리다.이것은 것은 싶이 피에 커다란 용기가 밥을 뭇 있다.',
    '설산에서 청춘을 그것은 관현악이며, 어디 것이다. 청춘의 용감하고 그들의 뿐이다. 시들어 얼음에 놀이 고동을 못할 풀이 것이다. 산야에 그들에게 날카로우나 귀는 바이며, 인생을 위하여서. 낙원을 현저하게 있는 그들에게 듣는다. 목숨이 같은 새 청춘에서만 찾아 그들은 피고 봄바람이다. 이 굳세게 바이며, 그들에게 웅대한 없으면, 천지는 듣는다. 그들은 공자는 놀이 아름다우냐?'
  ],
  canvasDesc: [
    '청춘의 풀이 이는 귀는 그들의 노년에게서 운다. 인생을 오아이스도 간에 스며들어 때에, 지혜는 것이다. 구할 싸인 싹이 위하여서 어디 무엇이 광야에서 따뜻한 아름다우냐? 있는 청춘의 이상 용감하고 있는가? 천하를 예가 날카로우나 아름답고 인도하겠다는 철환하였는가? 소리다.이것은 것은 싶이 피에 커다란 용기가 밥을 뭇 있다.',
  ],
  canvas: <SegCanvas/>,
};
const dfs = {
  pathname: "/algorithms/contents/dfs",
  title: 'DFS',
  description: [
    '청춘의 풀이 이는 귀는 그들의 노년에게서 운다. 인생을 오아이스도 간에 스며들어 때에, 지혜는 것이다. 구할 싸인 싹이 위하여서 어디 무엇이 광야에서 따뜻한 아름다우냐? 있는 청춘의 이상 용감하고 있는가? 천하를 예가 날카로우나 아름답고 인도하겠다는 철환하였는가? 소리다.이것은 것은 싶이 피에 커다란 용기가 밥을 뭇 있다.',
    '설산에서 청춘을 그것은 관현악이며, 어디 것이다. 청춘의 용감하고 그들의 뿐이다. 시들어 얼음에 놀이 고동을 못할 풀이 것이다. 산야에 그들에게 날카로우나 귀는 바이며, 인생을 위하여서. 낙원을 현저하게 있는 그들에게 듣는다. 목숨이 같은 새 청춘에서만 찾아 그들은 피고 봄바람이다. 이 굳세게 바이며, 그들에게 웅대한 없으면, 천지는 듣는다. 그들은 공자는 놀이 아름다우냐?'
  ],
  canvasDesc: [
    '청춘의 풀이 이는 귀는 그들의 노년에게서 운다. 인생을 오아이스도 간에 스며들어 때에, 지혜는 것이다. 구할 싸인 싹이 위하여서 어디 무엇이 광야에서 따뜻한 아름다우냐? 있는 청춘의 이상 용감하고 있는가? 천하를 예가 날카로우나 아름답고 인도하겠다는 철환하였는가? 소리다.이것은 것은 싶이 피에 커다란 용기가 밥을 뭇 있다.',
  ],
  canvas: <DfsCanvas/>,
};
const convex = {
  pathname: "/algorithms/contents/convex",
  title: 'Convex Hull',
  description: [
    '청춘의 풀이 이는 귀는 그들의 노년에게서 운다. 인생을 오아이스도 간에 스며들어 때에, 지혜는 것이다. 구할 싸인 싹이 위하여서 어디 무엇이 광야에서 따뜻한 아름다우냐? 있는 청춘의 이상 용감하고 있는가? 천하를 예가 날카로우나 아름답고 인도하겠다는 철환하였는가? 소리다.이것은 것은 싶이 피에 커다란 용기가 밥을 뭇 있다.',
    '설산에서 청춘을 그것은 관현악이며, 어디 것이다. 청춘의 용감하고 그들의 뿐이다. 시들어 얼음에 놀이 고동을 못할 풀이 것이다. 산야에 그들에게 날카로우나 귀는 바이며, 인생을 위하여서. 낙원을 현저하게 있는 그들에게 듣는다. 목숨이 같은 새 청춘에서만 찾아 그들은 피고 봄바람이다. 이 굳세게 바이며, 그들에게 웅대한 없으면, 천지는 듣는다. 그들은 공자는 놀이 아름다우냐?'
  ],
  canvasDesc: [
    '청춘의 풀이 이는 귀는 그들의 노년에게서 운다. 인생을 오아이스도 간에 스며들어 때에, 지혜는 것이다. 구할 싸인 싹이 위하여서 어디 무엇이 광야에서 따뜻한 아름다우냐? 있는 청춘의 이상 용감하고 있는가? 천하를 예가 날카로우나 아름답고 인도하겠다는 철환하였는가? 소리다.이것은 것은 싶이 피에 커다란 용기가 밥을 뭇 있다.',
  ],
  canvas: <ConvexCanvas/>,
};
const stack = {
  pathname: "/algorithms/contents/stack",
  title: 'Stack',
  description: [
    '청춘의 풀이 이는 귀는 그들의 노년에게서 운다. 인생을 오아이스도 간에 스며들어 때에, 지혜는 것이다. 구할 싸인 싹이 위하여서 어디 무엇이 광야에서 따뜻한 아름다우냐? 있는 청춘의 이상 용감하고 있는가? 천하를 예가 날카로우나 아름답고 인도하겠다는 철환하였는가? 소리다.이것은 것은 싶이 피에 커다란 용기가 밥을 뭇 있다.',
    '설산에서 청춘을 그것은 관현악이며, 어디 것이다. 청춘의 용감하고 그들의 뿐이다. 시들어 얼음에 놀이 고동을 못할 풀이 것이다. 산야에 그들에게 날카로우나 귀는 바이며, 인생을 위하여서. 낙원을 현저하게 있는 그들에게 듣는다. 목숨이 같은 새 청춘에서만 찾아 그들은 피고 봄바람이다. 이 굳세게 바이며, 그들에게 웅대한 없으면, 천지는 듣는다. 그들은 공자는 놀이 아름다우냐?'
  ],
  canvasDesc: [
    '청춘의 풀이 이는 귀는 그들의 노년에게서 운다. 인생을 오아이스도 간에 스며들어 때에, 지혜는 것이다. 구할 싸인 싹이 위하여서 어디 무엇이 광야에서 따뜻한 아름다우냐? 있는 청춘의 이상 용감하고 있는가? 천하를 예가 날카로우나 아름답고 인도하겠다는 철환하였는가? 소리다.이것은 것은 싶이 피에 커다란 용기가 밥을 뭇 있다.',
  ],
  canvas: <SegCanvas/>,
};
const notFound = {
  pathname: "/algorithms/contents/",
  title: 'Not Found',
  description: [
    '청춘의 풀이 이는 귀는 그들의 노년에게서 운다. 인생을 오아이스도 간에 스며들어 때에, 지혜는 것이다. 구할 싸인 싹이 위하여서 어디 무엇이 광야에서 따뜻한 아름다우냐? 있는 청춘의 이상 용감하고 있는가? 천하를 예가 날카로우나 아름답고 인도하겠다는 철환하였는가? 소리다.이것은 것은 싶이 피에 커다란 용기가 밥을 뭇 있다.',
    '설산에서 청춘을 그것은 관현악이며, 어디 것이다. 청춘의 용감하고 그들의 뿐이다. 시들어 얼음에 놀이 고동을 못할 풀이 것이다. 산야에 그들에게 날카로우나 귀는 바이며, 인생을 위하여서. 낙원을 현저하게 있는 그들에게 듣는다. 목숨이 같은 새 청춘에서만 찾아 그들은 피고 봄바람이다. 이 굳세게 바이며, 그들에게 웅대한 없으면, 천지는 듣는다. 그들은 공자는 놀이 아름다우냐?'
  ],
  canvasDesc: [
    '청춘의 풀이 이는 귀는 그들의 노년에게서 운다. 인생을 오아이스도 간에 스며들어 때에, 지혜는 것이다. 구할 싸인 싹이 위하여서 어디 무엇이 광야에서 따뜻한 아름다우냐? 있는 청춘의 이상 용감하고 있는가? 천하를 예가 날카로우나 아름답고 인도하겠다는 철환하였는가? 소리다.이것은 것은 싶이 피에 커다란 용기가 밥을 뭇 있다.',
  ],
  canvas: <div/>,
}

function useAlgorithms() {
  return {
    seg: seg,
    aho: aho,
    dfs: dfs,
    stack: stack,
    convex: convex,
    isShowingAlgorithm: function(pathname){
      return (pathname.substr(0, 21) == "/algorithms/contents/");
    },
    getAlgorithm: function(pathname){
      let name = pathname.substr(21, pathname.length);
      if (this.hasOwnProperty(name)){
        return this[name];
      }
      else return notFound;
    }
  };
};

export { useAlgorithms };
